# Python - MySQL Database Connection
1. Download and Import "mysql.connector" module
2. Create the connection object
3. Create the cursor object
4. Execute the query

### Connect()
Is used to create the connection with the database

In [2]:
import mysql.connector

conn = mysql.connector.connect(user = 'root', password = 'password12$', 
                               host = '127.0.0.1', database = 'company')
conn.close()

In [3]:
from mysql.connector import errorcode

try:
    conn = mysql.connector.connect(user = 'root', password = 'password12$', 
                              host = '127.0.0.1', database = 'employ')
except mysql.connector.Error as err:
    pass

conn.close()

In [7]:
import mysql.connector

config = {
    'user': 'root',
    'password': 'password12$', 
    'host': '127.0.0.1',
    'database': 'company',
    'raise_on_warnings': True
}

conn = mysql.connector.connect(**config)
conn.close()

In [13]:
# Creating a connection
conn = mysql.connector.connect(user = 'root', password = 'password12$', 
                               host = 'localhost')
# Creating a cursor
curs = conn.cursor()

In [14]:
# Creating 'RoadwayTravels' database
curs.execute('CREATE DATABASE IF NOT EXISTS RoadwayTravels')

In [16]:
# Observing the existing databases
curs.execute('SHOW DATABASES')
for db in curs:
    print(db)
conn.close()

('information_schema',)
('company',)
('company1',)
('demo',)
('electronics',)
('leetcode',)
('mysql',)
('performance_schema',)
('python_test',)
('roadway_travels',)
('roadwaytravels',)
('sakila',)
('sql_hr',)
('sql_inventory',)
('sql_invoicing',)
('sql_practice',)
('sql_store',)
('sys',)
('venu',)
('world',)

In [17]:
# Creating mysql connection with roadwaytravels database

conn = mysql.connector.connect(user = 'root', password = 'password12$', 
                              host = 'localhost', database = 'roadwaytravels')

# Creating cursor

curs = conn.cursor()

## Creating Tables

In [18]:
curs.execute('create table bus(bno int primary key, bname varchar(20), source varchar(20), destination varchar(20), arrtime time, deptime time)')
curs.execute('create table passenger(pid int primary key, pname varchar(20),age int, gender varchar(20), phno numeric, email varchar(50))')
curs.execute('create table ticket(tid int primary key, pid int, bno int,bdate date, price int, foreign key(bno) references bus(bno) on update cascade on delete cascade,foreign key(pid) references passenger(pid) on update cascade on delete cascade)')
curs.execute('create table reservation(tid int, jdate date, status varchar(20), remarks varchar(50), foreign key(tid) references ticket(tid) on update cascade on delete cascade)')
curs.execute('create table cancellation(tid int, jdate date, status varchar(20), remarks varchar(50), foreign key(tid) references ticket(tid) on update cascade on delete cascade)')

In [19]:
curs.execute('SHOW TABLES')
for tab in curs:
    print(tab)

('bus',)
('cancellation',)
('passenger',)
('reservation',)
('ticket',)

## Populating the tables

In [20]:
# Populating 'bus' table

sql = '''
    INSERT INTO bus (bno, bname, source, destination, arrtime, deptime) 
    VALUES (10, 'orange', 'HYDERABAD', 'BANGLORE', '19:30:00', '05:00:00')'''
curs.execute(sql)
conn.commit()
print(curs.rowcount, 'was inserted')

1 was inserted

In [22]:
# Alternatively

sql = '''INSERT INTO bus (bno, bname, source, destination, arrtime, deptime)
    VALUES (%s, %s, %s, %s, %s, %s)'''
val = (20,'KAVERI','HYDERABAD','CHENNAI','20:30:00','06:00:00')

curs.execute(sql, val)
conn.commit()
print(curs.rowcount, 'was inserted')

1 was inserted

In [23]:
# Populating table with many records

val = [
    (30,'KESINENI','HYDERABAD','MUMBAI','21:30:00','10:00:00'),
    (40,'KOMITLA','BANGLORE','DELHI','11:30:00','20:00:00'),
    (50,'DIVAKAR','CHENNAI','MYSORE','10:30:00','19:00:00'),
    (60,'KALESWARI','MUMBAI','TIRUPATI','08:30:00','23:00:00')
] 

curs.executemany(sql, val)
print(curs.rowcount, 'was inserted')

4 was inserted

In [25]:
# Populating 'passenger' table

sql = '''INSERT INTO passenger(pid, pname, age, gender, phno, email) 
    VALUES (%s, %s, %s, %s, %s, %s)'''
val = [
    (1,'TEJA','18','FEMALE ','9191919191','TEJA@GMAIL.COM'),
       (2,'LAVANYA ','19','FEMALE ','9292929292','LAVANYA @GMAIL.COM'),
       (3,'SHRAVYA ','18','FEMALE ','9393939393','SHRAVYA@GMAIL.COM'),
       (4,'PRAVALIKA','19','FEMALE ','9494949494','PRAVALIKA@GMAIL.COM'),
       (5,'SREENU','26','MALE ','9595959595','SREENU@GMAIL.COM'),
       (6,'VASU','50','MALE ','9696969696','VASU@GMAIL.COM'),
       (7,'NIVAS','35','MALE ','9797979797','NIVAS@GMAIL.COM')
]

curs.executemany(sql, val)
conn.commit()
print(curs.rowcount, 'was inserted')

7 was inserted

In [30]:
# Populating 'ticket' table

sql = 'INSERT INTO ticket (tid, pid, bno, bdate, price) VALUES (%s, %s, %s, %s, %s)'
val = [
    (101,1,20,'2017-01-07',2000),
       (102,2,30,'2017-01-07',3000),
       (103,3,10,'2017-01-07',1500),
       (104,4,20,'2017-01-08',2000),
       (105,1,50,'2017-01-08',2500),
       (106,2,60,'2017-01-08',2600),
       (107,5,10,'2017-01-09',1500),
       (108,6,50,'2017-01-09',2500),
       (109,5,40,'2017-01-10',2400),
       (110,1,40,'2017-01-10',2400)
]
curs.executemany(sql, val)
conn.commit()
print(curs.rowcount, 'was inserted')

10 was inserted

In [31]:
# Populating 'reservation' table

sql = 'INSERT INTO reservation (tid, jdate, status, remarks) VALUES (%s, %s, %s, %s)'
val = [
    (101,'2017-01-12','YES','GOOD'),
       (102,'2017-01-12','YES','GOOD'),
       (103,'2017-01-13','YES','GOOD'),
       (104,'2017-01-13','YES',''),
       (107,'2017-01-13','YES','GOOD'),
       (108,'2017-01-14','NO','GOOD'),
       (109,'2017-01-15','YES','')
]
curs.executemany(sql, val)
conn.commit()
print(curs.rowcount, 'was inserted')

7 was inserted

In [32]:
# Populating 'cancellation' table

sql = 'INSERT INTO cancellation (tid, jdate, status, remarks) VALUES (%s, %s, %s, %s)'
val = [
    (105,'2017-01-08','YES','BAD SERVICE'),
       (106,'2017-01-09','YES',''),
       (110,'2017-01-10','NO','JOURNEY POSTPONED')
]
curs.executemany(sql, val)
conn.commit()
print(curs.rowcount, 'was inserted')

3 was inserted

### conn.close() is used to close the connection

## Extracting records from tables

In [33]:
query = 'SELECT * FROM bus'
curs.execute(query)
result = curs.fetchall()
for x in result:
    print(x)

(10, 'orange', 'HYDERABAD', 'BANGLORE', datetime.timedelta(seconds=70200), datetime.timedelta(seconds=18000))
(20, 'KAVERI', 'HYDERABAD', 'CHENNAI', datetime.timedelta(seconds=73800), datetime.timedelta(seconds=21600))
(30, 'KESINENI', 'HYDERABAD', 'MUMBAI', datetime.timedelta(seconds=77400), datetime.timedelta(seconds=36000))
(40, 'KOMITLA', 'BANGLORE', 'DELHI', datetime.timedelta(seconds=41400), datetime.timedelta(seconds=72000))
(50, 'DIVAKAR', 'CHENNAI', 'MYSORE', datetime.timedelta(seconds=37800), datetime.timedelta(seconds=68400))
(60, 'KALESWARI', 'MUMBAI', 'TIRUPATI', datetime.timedelta(seconds=30600), datetime.timedelta(seconds=82800))

In [34]:
query = 'SELECT bno, bname FROM bus'
curs.execute(query)
result = curs.fetchall()
for x in result:
    print(x)

(10, 'orange')
(20, 'KAVERI')
(30, 'KESINENI')
(40, 'KOMITLA')
(50, 'DIVAKAR')
(60, 'KALESWARI')

In [35]:
type(result)

list

In [36]:
query = 'SELECT bno, bname FROM bus'
curs.execute(query)
result = curs.fetchone()
print(result)

(10, 'orange')

In [37]:
type(result)

tuple

In [38]:
result = curs.fetchmany(2)
for x in result:
    print(x)

(20, 'KAVERI')
(30, 'KESINENI')

In [39]:
result = curs.fetchall()
for x in result:
    print(x)

(40, 'KOMITLA')
(50, 'DIVAKAR')
(60, 'KALESWARI')

## MySQL Table to DataFrame

In [40]:
import pandas as pd

query = 'SELECT * FROM bus'
curs.execute(query)
result = curs.fetchall()
df = pd.DataFrame(result)
df

    0          1          2         3        4        5
0  10     orange  HYDERABAD  BANGLORE 19:30:00 05:00:00
1  20     KAVERI  HYDERABAD   CHENNAI 20:30:00 06:00:00
2  30   KESINENI  HYDERABAD    MUMBAI 21:30:00 10:00:00
3  40    KOMITLA   BANGLORE     DELHI 11:30:00 20:00:00
4  50    DIVAKAR    CHENNAI    MYSORE 10:30:00 19:00:00
5  60  KALESWARI     MUMBAI  TIRUPATI 08:30:00 23:00:00

In [44]:
df = pd.read_sql(query, conn)
df

   bno      bname     source destination  arrtime  deptime
0   10     orange  HYDERABAD    BANGLORE 19:30:00 05:00:00
1   20     KAVERI  HYDERABAD     CHENNAI 20:30:00 06:00:00
2   30   KESINENI  HYDERABAD      MUMBAI 21:30:00 10:00:00
3   40    KOMITLA   BANGLORE       DELHI 11:30:00 20:00:00
4   50    DIVAKAR    CHENNAI      MYSORE 10:30:00 19:00:00
5   60  KALESWARI     MUMBAI    TIRUPATI 08:30:00 23:00:00

In [42]:
df = pd.read_sql(query, conn, index_col = 'bno')
df

         bname     source destination  arrtime  deptime
bno
10      orange  HYDERABAD    BANGLORE 19:30:00 05:00:00
20      KAVERI  HYDERABAD     CHENNAI 20:30:00 06:00:00
30    KESINENI  HYDERABAD      MUMBAI 21:30:00 10:00:00
40     KOMITLA   BANGLORE       DELHI 11:30:00 20:00:00
50     DIVAKAR    CHENNAI      MYSORE 10:30:00 19:00:00
60   KALESWARI     MUMBAI    TIRUPATI 08:30:00 23:00:00

In [45]:
data = df[['bno', 'bname']]
data

   bno      bname
0   10     orange
1   20     KAVERI
2   30   KESINENI
3   40    KOMITLA
4   50    DIVAKAR
5   60  KALESWARI

In [47]:
conn.close()

In [ ]:
"""
from sqlalchemy import create_engine


# Setting database credentials
creds = {
    'user': 'root', 
    'password': 'password12$', 
    'host': 'localhost',
    'port': 3306,
    'database': 'roadwaytravels'
}

# MySQL connection string
connstr = 'mysql+mysqlconnector://{user}:{password}@{host}:{port}/{database}'

# Creating sqlalchemy engine for mysql connection
engine = create_engine(conn.format(**creds))
"""

In [52]:
for i, row in df.iterrows():
    print(tuple(row))

(10, 'orange', 'HYDERABAD', 'BANGLORE', Timedelta('0 days 19:30:00'), Timedelta('0 days 05:00:00'))
(20, 'KAVERI', 'HYDERABAD', 'CHENNAI', Timedelta('0 days 20:30:00'), Timedelta('0 days 06:00:00'))
(30, 'KESINENI', 'HYDERABAD', 'MUMBAI', Timedelta('0 days 21:30:00'), Timedelta('0 days 10:00:00'))
(40, 'KOMITLA', 'BANGLORE', 'DELHI', Timedelta('0 days 11:30:00'), Timedelta('0 days 20:00:00'))
(50, 'DIVAKAR', 'CHENNAI', 'MYSORE', Timedelta('0 days 10:30:00'), Timedelta('0 days 19:00:00'))
(60, 'KALESWARI', 'MUMBAI', 'TIRUPATI', Timedelta('0 days 08:30:00'), Timedelta('0 days 23:00:00'))

## DataFrame to MySQL Table

In [69]:
# Creating database connection
creds = {
    'user': 'root', 
    'password': 'password12$', 
    'host': 'localhost',
    'database': 'roadwaytravels'
}
conn = mysql.connector.connect(**creds)
curs = conn.cursor()
print(conn)

<mysql.connector.connection.MySQLConnection object at 0x0000028B085A45B0>

In [70]:
# Creating a new table 
query1 = '''CREATE TABLE IF NOT EXISTS df_table 
    (bno INTEGER PRIMARY KEY NOT NULL UNIQUE, bname VARCHAR(40), source VARCHAR(40), 
    destination VARCHAR(40), arrtime TIME, deptime TIME)'''
curs.execute(query1)
conn.commit()

In [71]:
# Converting the observations of the dataframe into list of tuples
val = []
for i, row in df.iterrows():
    val.append(tuple(row))
val

[(10,
  'orange',
  'HYDERABAD',
  'BANGLORE',
  Timedelta('0 days 19:30:00'),
  Timedelta('0 days 05:00:00')),
 (20,
  'KAVERI',
  'HYDERABAD',
  'CHENNAI',
  Timedelta('0 days 20:30:00'),
  Timedelta('0 days 06:00:00')),
 (30,
  'KESINENI',
  'HYDERABAD',
  'MUMBAI',
  Timedelta('0 days 21:30:00'),
  Timedelta('0 days 10:00:00')),
 (40,
  'KOMITLA',
  'BANGLORE',
  'DELHI',
  Timedelta('0 days 11:30:00'),
  Timedelta('0 days 20:00:00')),
 (50,
  'DIVAKAR',
  'CHENNAI',
  'MYSORE',
  Timedelta('0 days 10:30:00'),
  Timedelta('0 days 19:00:00')),
 (60,
  'KALESWARI',
  'MUMBAI',
  'TIRUPATI',
  Timedelta('0 days 08:30:00'),
  Timedelta('0 days 23:00:00'))]

In [72]:
# Populating the new table with rows from the dataframe
query2 = '''INSERT INTO df_table (bno, bname, source, destination, arrtime, deptime)
    VALUES (%s, %s, %s, %s, %s, %s)'''

curs.executemany(query2, val)
conn.commit()
print(curs.rowcount, 'was inserted')

6 was inserted

In [73]:
# Extracting the populated data from the new table
curs.execute('SELECT * FROM df_table')
result = curs.fetchall()
for i in result:
    print(i)

(10, 'orange', 'HYDERABAD', 'BANGLORE', datetime.timedelta(seconds=70200), datetime.timedelta(seconds=18000))
(20, 'KAVERI', 'HYDERABAD', 'CHENNAI', datetime.timedelta(seconds=73800), datetime.timedelta(seconds=21600))
(30, 'KESINENI', 'HYDERABAD', 'MUMBAI', datetime.timedelta(seconds=77400), datetime.timedelta(seconds=36000))
(40, 'KOMITLA', 'BANGLORE', 'DELHI', datetime.timedelta(seconds=41400), datetime.timedelta(seconds=72000))
(50, 'DIVAKAR', 'CHENNAI', 'MYSORE', datetime.timedelta(seconds=37800), datetime.timedelta(seconds=68400))
(60, 'KALESWARI', 'MUMBAI', 'TIRUPATI', datetime.timedelta(seconds=30600), datetime.timedelta(seconds=82800))

In [74]:
query = 'SELECT * FROM df_table'
data = pd.read_sql(query, conn)
data

   bno      bname     source destination  arrtime  deptime
0   10     orange  HYDERABAD    BANGLORE 19:30:00 05:00:00
1   20     KAVERI  HYDERABAD     CHENNAI 20:30:00 06:00:00
2   30   KESINENI  HYDERABAD      MUMBAI 21:30:00 10:00:00
3   40    KOMITLA   BANGLORE       DELHI 11:30:00 20:00:00
4   50    DIVAKAR    CHENNAI      MYSORE 10:30:00 19:00:00
5   60  KALESWARI     MUMBAI    TIRUPATI 08:30:00 23:00:00

## LOAD DATA INFILE
### Bulk Insert, Bulk Delete, Bulk Update, Bulk Merge
### Syntax:

1. LOAD DATA [LOW_PRIORITY | CONCURRENT] [LOCAL] INFILE 'file_name'
2. INTO TABLE tbl_name
3. [CHARACTER SET charset]
4. [{FIELDS | COLUMNS} [TERMINATED BY 'string'] [[OPTIONALLY] ENCLOSED BY 'char']]
5. [LINES [STARTING BY 'string'] [TERMINATED BY 'string'] ]
6. [IGNORE number {LINES | ROWS}]
7. [(col_name_or_user_var,...)]
8. [SET col_name = expr,...]

In [82]:
query1 = '''
    CREATE TABLE IF NOT EXISTS cars (name VARCHAR(40), year VARCHAR(20), 
    selling_price INTEGER, km_driven INTEGER, fuel VARCHAR(20), seller_type VARCHAR(20), 
    transmission VARCHAR(20), owner VARCHAR(20))
'''

curs.execute(query1)

query2 = """
    LOAD DATA INFILE 'anaconda3/car%20data.csv'
    INTO TABLE cars
    FIELDS TERMINATED BY ','
    LINES TERMINATED BY '\n'
    IGNORE 1 LINES
"""

curs.execute(query2)
conn.commit()

DatabaseError: 1290 (HY000): The MySQL server is running with the --secure-file-priv option so it cannot execute this statement

In [83]:
curs.execute('SHOW VARIABLES LIKE "secure_file_priv"')

In [84]:
result = curs.fetchall()
print(result)

[('secure_file_priv', 'C:\\ProgramData\\MySQL\\MySQL Server 5.7\\Uploads\\')]

In [85]:
conn.close()